# Reading Comma Separated File

Here we read CSV files with Pandas read_csv() function

First we have to import both NumPy and Pandas:

In [1]:
import numpy as np
import pandas as pd

Here we use read_csv() to read 'fake_company.csv' file and return 'company' df

In [2]:
company = pd.read_csv('./fake_company.csv')
company

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991   Dakota         HR   26   52000
4  1991     Elsa         RD   31   50000
5  1991    Frank      Admin   46   60000
6  1992    Grace      Admin   27   60000
7  1992  Hoffman         RD   32   52000
8  1992    Inaar      Admin   28   62000

Here we perform a couple of groupby() functions on the DataFrame.

In [4]:
company.groupby(['Year'])['Salary'].sum()

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [5]:
company.groupby(['Year'])['Salary'].mean()

Year
1990    51000
1991    54000
1992    58000
Name: Salary, dtype: int64

In [6]:
company.groupby(['Name'])['Salary'].sum()

Name
Alice      50000
Bob        48000
Charlie    55000
Dakota     52000
Elsa       50000
Frank      60000
Grace      60000
Hoffman    52000
Inaar      62000
Name: Salary, dtype: int64

In [7]:
company.groupby(['Year', 'Name'])['Salary'].sum()

Year  Name
1990  Alice      50000
      Bob        48000
      Charlie    55000
1991  Dakota     52000
      Elsa       50000
      Frank      60000
1992  Grace      60000
      Hoffman    52000
      Inaar      62000
Name: Salary, dtype: int64

In [8]:
company.groupby(['Year', 'Department'])['Salary'].sum()

Year  Department
1990  Admin          55000
      HR             50000
      RD             48000
1991  Admin          60000
      HR             52000
      RD             50000
1992  Admin         122000
      RD             52000
Name: Salary, dtype: int64